/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstsize.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyungyoo <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/06/25 03:50:02 by hyungyoo          #+#    #+#             */
/*   Updated: 2021/06/25 03:53:29 by hyungyoo         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//
// lst 연결리스트가 끝날때까지
// 요소의 갯수를 구하여 반환
//
#include "libft.h"

int	ft_lstsize(t_list *lst)
{
	int	res;

	res = 0;
	while (lst)
	{
		lst = lst->next;
		res++;
	}
	return (res);
}
