/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyungyoo <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/06/25 03:32:48 by hyungyoo          #+#    #+#             */
/*   Updated: 2021/06/25 03:49:44 by hyungyoo         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//
// 연결리스트의 맨앞에 new를 추가
// 그러므로 새로운 요소의 next 포인터가 원래 리스트의 첫 요소를
// 가리키도록 해주며 리스트의 처음을 가리키는 포인터가
// 새로운 요소를 가리키도록 함
//
#include "libft.h"

void	ft_lstadd_front(t_list **lst, t_list *new)
{
	if (!lst || !new)
		return ;
	new->next = *lst;
	*lst = new;
}
